#include <iostream>

using namespace std;

int jump(int n, int& v, int& c) {
	if (n == 1) return 1;
	++c;
	c < 3 ? v *= 2 : v = v * 2 - 1;
	if (c < n - 1) return jump(n, v, c);
	else return v;
}

int main(){
	int n;
	int counter = 0;
	int vars = 1;

	cout << "Enter stair's number: ";
	cin >> n;

	cout << jump(n, vars, counter);

	return 0;
}

//4 ступеньки = 7 способов
//1,1,1,1
//2,2
//3,1
//1,3
//2,1,1
//1,2,1
//1,1,2

//5 ступенек = 13 способов
//1,1,1,1,1
//1,1,1,2
//1,1,2,1
//1,2,1,1
//2,1,1,1
//3,1,1
//1,3,1
//1,1,3
//2,2,1
//2,1,2
//1,2,2
//2,3
//3,2

//6 ступенек = 25 способов
//1,1,1,1,1,1
//2,1,1,1,1
//1,2,1,1,1
//1,1,2,1,1
//1,1,1,2,1
//1,1,1,1,2
//3,1,1,1
//1,3,1,1
//1,1,3,1
//1,1,1,3
//3,2,1
//2,3,1
//2,1,3
//1,2,3
//1,3,2
//2,2,1,1
//1,1,2,2
//1,2,1,2
//2,1,2,1
//2,1,1,2
//1,2,2,1
//2,2,2
//3,3
